Revit 2027 API
FabricationConfiguration.GetInsulationSpecificationGroup Method
 Gets the insulation specification group from its identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string GetInsulationSpecificationGroup(
	int specId
)
Public Function GetInsulationSpecificationGroup (
	specId As Integer
) As String
public:
String^ GetInsulationSpecificationGroup(
	int specId
)
member GetInsulationSpecificationGroup :
        specId : int -> string
Parameters
specId Int32
 The insulation specification identifier.
Return Value
String
 The insulation specification group.
See Also
Reference
FabricationConfiguration Class
Autodesk.Revit.DB Namespace